In [140]:
import pandas as pd

# Series

In [141]:
data = [1,2,3,4,5]

In [142]:
s = pd.Series(data)

In [143]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [144]:
index = ['Linha' + str(i) for i in range(5)]

In [145]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [146]:
s = pd.Series(data = data, index = index) #Criando rótulos para linha

In [147]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [148]:
data = {'Linha' + str(i) : i + 1 for i in range(5)} #Criou um dicionário

In [149]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [150]:
s = pd.Series(data)

In [151]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [152]:
s1 = s + 2 # Somou 2 para cada linha do index

In [153]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [154]:
s2 = s + s1 #Soma-se os resultados de s + s1

In [155]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

In [156]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [157]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [158]:
df1 = pd.DataFrame(data)

In [159]:
df1 # Dataframe simples

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [160]:
index = ['Linha' + str(i) for i in range(3)]

In [161]:
index

['Linha0', 'Linha1', 'Linha2']

In [162]:
df1 = pd.DataFrame(data = data, index = index) # nomeando o índice

In [163]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [164]:
columns = ['Coluna' + str(i) for i in range(3)]

In [165]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [166]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [167]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [168]:
df1[df1 > 0] = 'A' # Se df1 for maior que zero, me traz 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [171]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)

In [172]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [173]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [174]:
df4 = pd.concat([df1, df2])# Concat faz a concatenação entre duas tabelas

In [175]:
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [178]:
df4 = pd.concat([df1, df2], axis = 1) # Ao invés de organizar um embaixo do outro, o axi organiza ao lado
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B
Linha1       A       A       A       B       B       B
Linha2       A       A       A       B       B       B